package lesson10;

/*
Необходимо реализовать конвертер температур, который сможет переводить единицы измерения одной системы в другую
(например, из Цельсий в Фаренгейты, или из Кельвин в Цельсий).

Конвертер должен быть универсальным с возможностью перевода в обоих направлениях для каждой из комбинаций.
В задании требуется максимально воспользоваться возможностями интерфейсов и перечислений, насколько это возможно.

По тому же принципу можно реализовать валютный конвертер или любой понравившийся
 */
public class Main {
    public static void main(String[] args) {

    }
}
